# Documented checklist at https://github.com/conallob/New-Machine/blob/master/osx-setup.md

# specify a directory to install
cask_args appdir: '/Applications'

# Customize Env

brew "chezmoi"
brew "mas"

# Coding Languages & Tools

brew "go"
brew "python@3.12"
brew "virtualenvwrapper"
brew "git"
cask "goland"
cask "jetbrains-toolbox"

# Vim & Editor Tools
brew "vim"  # Modern Vim with LSP support
brew "ripgrep"  # Fast grep alternative for searching
brew "fzf"  # Fuzzy finder
brew "fd"  # Fast find alternative
cask "font-hack-nerd-font"  # Nerd Font for vim-devicons

# Language Servers (LSP)
brew "gopls"  # Go language server
brew "basedpyright"  # Python language server (faster than pyright)
brew "marksman"  # Markdown language server
brew "yaml-language-server"  # YAML language server
brew "texlab"  # LaTeX language server

# Linters & Formatters
brew "golangci-lint"  # Go meta-linter
brew "ruff"  # Fast Python linter & formatter
brew "mypy"  # Python static type checker
brew "black"  # Python code formatter
brew "isort"  # Python import sorter
brew "shellcheck"  # Shell script linter
brew "markdownlint-cli"  # Markdown linter
brew "hadolint"  # Dockerfile linter
brew "yamllint"  # YAML linter
brew "prettier"  # Multi-language code formatter

# Container tools
brew "podman"
cask "podman-desktop"

# Kubernetes tools
brew "kubectl"
brew "krew"
brew "kustomize"
brew "k9s"
brew "kubectx"
brew "talosctl"

# General Utilities
brew "jq"
brew "protobuf"
brew "pssh"
brew "yq"

# Terminal
cask "ghostty"
brew "tmux"
brew "zellij"

# ZSH & Shell Environment

brew "atuin"
brew "powerlevel10k"
brew "zsh-autosuggestions"

# AI Chatbot
cask "claude"
cask "claude-code"

## Personally Developed MCPs
tap "conallob/tap"
brew "mcp-ssh-wingman"
brew "mcp-omnifocus"

# Utilities

cask "google-chrome"
cask "google-drive" 
cask "1password"
cask "1password-cli"

cask "alfred"
cask "appzapper"
cask "bartender"

cask "spotify"
cask "displaylink"

cask "signal"
cask "whatsapp"

# Productivity

cask "timeular"
cask "obsidian"
cask "elgato-stream-deck"
mas "Omnifocus", id: 1542143627
mas "Flycut", id: 442160987
mas "Remarkable", id: 1276493162

## Personal Use

mas "Pixelmator Pro", id: 1289583905
mas "Home Assistant", id: 1099568401
mas "Tailscale", id: 1475387142

cask "snapmaker-luban"
cask "8bitdo-ultimate-software"
