# Documented checklist at https://github.com/conallob/New-Machine/blob/master/osx-setup.md

# specify a directory to install
cask_args appdir: '/Applications'

# Customize Env

brew "chezmoi"
brew "mas"

# Coding Languages & Tools

brew "go"
brew "python@3.12"
brew "git"
cask "goland"

# Terminal
cask "ghostty"

# ZSH & Shell Environment

brew "atuin"
brew "powerlevel10k"
brew "zsh-autosuggestions"

# AI Chatbots
# TODO(conallob): There can only be one
cask "chatgpt"
cask "claude"

# Utilities

cask "google-chrome"
cask "google-drive" 
cask "1password"
cask "1password-cli"

cask "alfred"
cask "appzapper"
cask "bartender"

cask "spotify"
cask "displaylink"

cask "signal"
cask "whatsapp"

# Productivity

cask "timeular"
cask "elgato-stream-deck"
mas "Omnifocus", id: 1542143627
mas "Flycut", id: 442160987
mas "Remarkable", id: 1276493162

## Personal

mas "Pixelmator Pro", id: 1289583905
mas "Home Assistant", id: 1099568401
mas "Tailscale", id: 1475387142
cask "snapmaker-luban"
cask "8bitdo-ultimate-software"
